# YOLOv12 Triple Input with lightweight DINOv3 late fusion at P5
# Starts from the standard triple YOLOv12 path and adds a gated residual
# DINOv3 module only on the final P5 feature before Detect.

nc: 80
ch: 9
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, TripleInputConv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]            # 2
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]             # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]            # 4-P3
  - [-1, 1, Conv, [512, 3, 2]]                   # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]               # 6-P4
  - [-1, 1, Conv, [1024, 3, 2]]                  # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]              # 8-P5

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 9
  - [[-1, 6], 1, Concat, [1]]                    # 10 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]]             # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 4], 1, Concat, [1]]                    # 13 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]]             # 14

  - [-1, 1, Conv, [256, 3, 2]]                   # 15
  - [[-1, 11], 1, Concat, [1]]                   # 16 cat head P4
  - [-1, 2, A2C2f, [512, False, -1]]             # 17

  - [-1, 1, Conv, [512, 3, 2]]                   # 18
  - [[-1, 8], 1, Concat, [1]]                    # 19 cat backbone P5
  - [-1, 2, C3k2, [1024, True]]                  # 20 P5/32-large
  - [-1, 1, DINOv3P5LiteFusion, [1024, 1024, "facebook/dinov3-vitb16-pretrain-lvd1689m", True, 32, -6.0]] # 21 gated DINO-lite@P5

  - [[14, 17, 21], 1, Detect, [nc]]              # 22 Detect(P3, P4, P5)
