# YOLOv12m Triple Input - scale 'm' hardcoded (no dynamic scale selection)
nc: 80
ch: 9
depth_multiple: 0.50
width_multiple: 1.00
max_channels: 512

# YOLO12-triple backbone with 9-channel input
backbone:
  # [from, repeats, module, args]
  - [-1, 1, TripleInputConv, [64, 3, 2]]     # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]]        # 1-P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]]        # 3-P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]]              # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv,  [1024, 3, 2]]             # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]          # 8

# YOLO12-triple head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]         # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, A2C2f, [256, False, -1]]         # 14

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]         # 17

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]              # 20

  - [[14, 17, 20], 1, Detect, [nc]]
