# YOLOv12 Triple Input with DINOv3 at both P3 and P4 stages (dual mode)
# 9-channel input (3 views) + real DINOv3 at P3 + P4

nc: 80
ch: 9
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, TripleInputConv, [64, 3, 2]]         # 0-P1/2  triple 9ch input
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]            # 2
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]             # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]            # 4-P3
  - [-1, 1, DINOv3FeatureEnhancer, [512, 512, "facebook/dinov3-vitl16-pretrain-lvd1689m", True]]  # 5-DINOv3@P3
  - [-1, 1, Conv, [512, 3, 2]]                   # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]               # 7-P4
  - [-1, 1, DINOv3FeatureEnhancer, [512, 512, "facebook/dinov3-vitl16-pretrain-lvd1689m", True]]  # 8-DINOv3@P4
  - [-1, 1, Conv, [1024, 3, 2]]                  # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]              # 10-P5

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 8], 1, Concat, [1]]                    # 12 cat P4 (DINOv3 enhanced)
  - [-1, 2, A2C2f, [512, False, -1]]             # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 5], 1, Concat, [1]]                    # 15 cat P3 (DINOv3 enhanced)
  - [-1, 2, A2C2f, [256, False, -1]]             # 16

  - [-1, 1, Conv, [256, 3, 2]]                   # 17
  - [[-1, 13], 1, Concat, [1]]                   # 18
  - [-1, 2, A2C2f, [512, False, -1]]             # 19

  - [-1, 1, Conv, [512, 3, 2]]                   # 20
  - [[-1, 10], 1, Concat, [1]]                   # 21 cat P5
  - [-1, 2, C3k2, [1024, True]]                  # 22

  - [[16, 19, 22], 1, Detect, [nc]]              # Detect(P3, P4, P5)
