# YOLOv12 Triple Input with DINOv3 at P4 stage
# 9-channel input (3 views) + real DINOv3 feature enhancement after P4
# Adapted from Sompote/DINOV3-YOLOV12 to support triple-stream input

nc: 80
ch: 9
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, TripleInputConv, [64, 3, 2]]         # 0-P1/2  triple 9ch input
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]            # 2
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]             # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]            # 4-P3
  - [-1, 1, Conv, [512, 3, 2]]                   # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]               # 6-P4
  - [-1, 1, DINOv3FeatureEnhancer, [512, 512, "facebook/dinov3-vitl16-pretrain-lvd1689m", True]]  # 7-DINOv3@P4
  - [-1, 1, Conv, [1024, 3, 2]]                  # 8-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]              # 9-P5

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10
  - [[-1, 7], 1, Concat, [1]]                    # 11 cat P4 (DINOv3 enhanced)
  - [-1, 2, A2C2f, [512, False, -1]]             # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 4], 1, Concat, [1]]                    # 14 cat P3
  - [-1, 2, A2C2f, [256, False, -1]]             # 15

  - [-1, 1, Conv, [256, 3, 2]]                   # 16
  - [[-1, 12], 1, Concat, [1]]                   # 17
  - [-1, 2, A2C2f, [512, False, -1]]             # 18

  - [-1, 1, Conv, [512, 3, 2]]                   # 19
  - [[-1, 9], 1, Concat, [1]]                    # 20 cat P5
  - [-1, 2, C3k2, [1024, True]]                  # 21

  - [[15, 18, 21], 1, Detect, [nc]]              # Detect(P3, P4, P5)
